# Projet immobilier

## Reduction dataset

In [10]:
import pandas as pd

In [11]:
full_df = pd.read_csv(r"train.csv")

In [17]:
house_column = ["YearBuilt","BedroomAbvGr","TotalBsmtSF","GrLivArea","1stFlrSF","2ndFlrSF","OverallCond","KitchenQual","GarageCond","Neighborhood"]
sale_column = ["MoSold","YrSold","SalePrice"]
property_column = ["LotArea","Utilities"]

In [33]:
house_df = full_df[[x for x in full_df.columns if x in house_column]]
sale_df = full_df[[x for x in full_df.columns if x in sale_column]]
property_df = full_df[[x for x in full_df.columns if x in property_column]]

In [34]:
house_df.head()

,Neighborhood,OverallCond,YearBuilt,TotalBsmtSF,1stFlrSF,2ndFlrSF,GrLivArea,BedroomAbvGr,KitchenQual,GarageCond
0,CollgCr,5,2003,856,856,854,1710,3,Gd,TA
1,Veenker,8,1976,1262,1262,0,1262,3,TA,TA
2,CollgCr,5,2001,920,920,866,1786,3,Gd,TA
3,Crawfor,5,1915,756,961,756,1717,3,Gd,TA
4,NoRidge,5,2000,1145,1145,1053,2198,4,Gd,TA

In [48]:
house_df.rename(columns={"1stFlrSF": "FirstFlrSF", "2ndFlrSF": "SecondFlrSF"}, inplace= False)

,HouseID,Neighborhood,OverallCond,YearBuilt,TotalBsmtSF,FirstFlrSF,SecondFlrSF,GrLivArea,BedroomAbvGr,KitchenQual,GarageCond
0,H00001,CollgCr,5,2003,856,856,854,1710,3,Gd,TA
1,H00002,Veenker,8,1976,1262,1262,0,1262,3,TA,TA
2,H00003,CollgCr,5,2001,920,920,866,1786,3,Gd,TA
3,H00004,Crawfor,5,1915,756,961,756,1717,3,Gd,TA
4,H00005,NoRidge,5,2000,1145,1145,1053,2198,4,Gd,TA
...,...,...,...,...,...,...,...,...,...,...,...
1455,H01456,Gilbert,5,1999,953,953,694,1647,3,TA,TA
1456,H01457,NWAmes,6,1978,1542,2073,0,2073,3,TA,TA
1457,H01458,Crawfor,9,1941,1152,1188,1152,2340,4,Gd,TA
1458,H01459,NAmes,6,1950,1078,1078,0,1078,2,Gd,TA
1459,H01460,Edwards,6,1965,1256,1256,0,1256,3,TA,TA

In [49]:
house_df.insert(0,"HouseID",["H"+"0"*(5-len(str((i))))+ str(i) for i in range(1,1460+1)],True)

In [50]:
house_df.head()

,HouseID,HouseID,Neighborhood,OverallCond,YearBuilt,TotalBsmtSF,FirstFlrSF,SecondFlrSF,GrLivArea,BedroomAbvGr,KitchenQual,GarageCond
0,H00001,H00001,CollgCr,5,2003,856,856,854,1710,3,Gd,TA
1,H00002,H00002,Veenker,8,1976,1262,1262,0,1262,3,TA,TA
2,H00003,H00003,CollgCr,5,2001,920,920,866,1786,3,Gd,TA
3,H00004,H00004,Crawfor,5,1915,756,961,756,1717,3,Gd,TA
4,H00005,H00005,NoRidge,5,2000,1145,1145,1053,2198,4,Gd,TA

In [37]:
house_df.to_csv(r"house.csv", index=False)

In [38]:
sale_df.insert(0,"SaleID",["S"+"0"*(5-len(str((i))))+ str(i)for i in range(1,1460+1)],True)

In [39]:
sale_df.head()

   SaleID  MoSold  YrSold  SalePrice
0  S00001       2    2008     208500
1  S00002       5    2007     181500
2  S00003       9    2008     223500
3  S00004       2    2006     140000
4  S00005      12    2008     250000

In [40]:
sale_df.to_csv(r"sale.csv", index=False)

In [41]:
property_df.insert(0,"PropertyID",["P"+"0"*(5-len(str((i))))+ str(i) for i in range(1,1460+1)],True)

In [42]:
property_df.head()

  PropertyID  LotArea Utilities
0     P00001     8450    AllPub
1     P00002     9600    AllPub
2     P00003    11250    AllPub
3     P00004     9550    AllPub
4     P00005    14260    AllPub

In [43]:
property_df.to_csv(r"property.csv", index=False)

## Utiliser sql dans un notebook

In [4]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [ ]:
#conda install -c conda-forge ipython-sql

In [6]:
# import Modules
import sqlite3

## Connexion à une BDD sqlite (création)

In [8]:
%sql sqlite:///foo.db

'Connected: @foo.db'

In [9]:
con = sqlite3.connect("sakila.db")

In [56]:
%%sql
CREATE TABLE House
(
  HouseID varchar PRIMARY KEY,
  Neighborhood varchar,
  OverallCond integer,
  YearBuilt integer,
  TotalBsmtSF integer,
  FirstFlrSF integer,
  SecondFlrSF integer,
  GrLivArea integer,
  BedroomAbvGr integer,
  KitchenQual varchar,
  GarageCond varchar
);

   sqlite:///bddsqlite01.db
 * sqlite:///foo.db
Done.

[]

In [57]:
%%sql
CREATE TABLE Sale
(
  SaleID varchar PRIMARY KEY,
  MoSold integer,
  YrSold integer,
  SalePrice integer
);

   sqlite:///bddsqlite01.db
 * sqlite:///foo.db
Done.

[]

In [58]:
%%sql
CREATE TABLE Property
(
  PropertyID varchar PRIMARY KEY,
  LotArea integer,
  Utilities varchar
);

   sqlite:///bddsqlite01.db
 * sqlite:///foo.db
Done.

[]